{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft.AspNetCore": "Warning"
    }
  },
  "AllowedHosts": "*",
  "Settings": {
    "NavBarEnabled": true,
    "GitHubProfileUri": "https://github.com/nickmartin1ee7",
    "GitHubProfileApiUri": "https://api.github.com/users/nickmartin1ee7/repos",
    "ResumeUri": "https://drive.google.com/file/d/1ysO5zXVON4k-50SGalaqtJS9CtMoqgMA/view?usp=sharing",
    "CoverLetterUri": "https://drive.google.com/file/d/1DO7y4PCDVXaxrwojudazPlBBAujirYRw/view?usp=sharing",
    "MainLayoutLinks": [
      {
        "Title": "GitHub",
        "Uri": "https://github.com/nickmartin1ee7",
        "ImageUri": "https://logos-download.com/wp-content/uploads/2016/09/GitHub_logo.png"
      },
      {
        "Title": "LinkedIn",
        "Uri": "https://www.linkedin.com/in/nicholas-martin-0101",
        "ImageUri": "https://logos-world.net/wp-content/uploads/2020/04/Linkedin-Logo-2011-2019.png"
      }
    ],
    "AchievementItems": [
      {
        "Title": "Dean's List",
        "SubTitle": "Academic Awards",
        "Description": "Recognition by Todd A. Mooradian, Dean in the College of Business for achieving a High Academic Achievement.",
        "ImageUri": "DeansList2021.webp",
        "UriDescription": "PDF | Google Drive",
        "Uri": "https://drive.google.com/file/d/1_t4WHrCCp9IAaugtL5wJnDTfOdxRCBMU/view?usp=sharing"
      },
      {
        "Title": "Dean's Scholar",
        "SubTitle": "Academic Awards",
        "Description": "Recognition by Todd A. Mooradian, Dean in the College of Business for achieving a Highest Academic Achievement.",
        "ImageUri": "DeansScholar2022.webp",
        "UriDescription": "PDF | Google Drive",
        "Uri": "https://drive.google.com/file/d/1vARJ9eSVLAYRt927IG2b2U6hwCoLLlDa/view?usp=sharing"
      },
      {
        "Title": "Computer Information Systems Development Project",
        "SubTitle": "Culminating Undergraduate Experience",
        "Description": "A continuation of CIS 320, this course focuses on the detailed design and implementation phases of the system development life cycle, including user acceptance testing, test planning, design reviews, and change procedures. Specifications created in CIS 320 are used to implement, test, and install a working version of an information system. System deployment emphasizes a web-based architecture. A prototyping approach is taken to develop and test the system in an iterative manner. Students are grouped into project teams, and each team member accepts task assignments necessary to deliver the information system prototype.",
        "UriDescription": "Project Website | The Thompson Project",
        "Uri": "https://www.thompsonproject.net",
        "Bullets": [
          "Manage an Agile Team SLDC in an iterative fashion",
          "Create technical documentation describing created systems",
          "Built using: WordPress, Docker, Docker Compose, Nginx, Portainer, and Microsoft Azure"
        ]
      },
      {
        "Title": "Management of Information Systems",
        "SubTitle": "Culminating Undergraduate Experience",
        "Description": "Explores strategic development of information technology; value chain analysis and its application to information resource management; information systems planning; organizing, staffing, and controlling the deployment of information technology; the development of an IT platform and architecture consistent with organizational structure.",
        "UriDescription": "CIS-410 | Google Drive",
        "Uri": "https://drive.google.com/drive/folders/1L8XVKh6sxa-7r19_Ko-BvP86as-S8_6n?usp=share_link",
        "Bullets": [
          "Perform Case Analysis for a non-profit",
          "Industry Competitive Analysis",
          "Internet Enabled Business Model",
          "Porter's Five Forces"
        ]
      },
      {
        "Title": "Software Development II",
        "SubTitle": "Educational",
        "Description": "This course emphasizes object-oriented software development. Students study the object model and apply it to systems development problems. Topics include polymorphism, inheritance, and object interaction. Event-driven programming of graphical user interfaces is introduced. Application areas may include data structures, searching, sorting, and databases. Extensive programming assignments are required.",
        "UriDescription": "CIS-200 | GitHub Repos",
        "Uri": "https://github.com/search?q=user%3Anickmartin1ee7+CIS-200&type=repositories",
        "Bullets": [
          "Big-O notation",
          "Searching and sorting algorithms",
          "LINQ query syntax",
          "Visual inheritance"
        ]
      },
      {
        "Title": "Systems Analysis and Design",
        "SubTitle": "Educational",
        "Description": "This course introduces the fundamentals of object-oriented analysis and design, including experience with a CASE tool. Topics include requirements determination, feasibility analysis, modeling with Unified Modeling Language (UML) and data dictionary construction, data modeling and normalization, user interface requirements specification, and information security procedures. Development of problem and design specifications for an information systems project is required. Develops team skills, written and oral communication skills.",
        "UriDescription": "CIS-320 | Google Drive",
        "Uri": "https://drive.google.com/drive/folders/1rT5ckuOSp8du_6VrkCQ0DbWmml2iXWoD?usp=sharing",
        "Bullets": [
          "Use Case Documentation",
          "Structural (UML Diagrams, E-R Diagrams, Class Diagrams, Story Cards)",
          "Behavioral (Sequence Diagrams, Process Flows)"
        ]
      },
      {
        "Title": "Database Design",
        "SubTitle": "Educational",
        "Description": "This course will provide a solid and practical foundation for the design and implementation of database systems. Emphasis will be on relational database models, with significant coverage of basic relational database concepts, normalization, E-R modeling, locking, SQL, and distributed databases. Additional topics include web database, database security, access control policies and procedures, risk management, and ethical aspects of information handling. Course software includes current database tools such as SQL server.",
        "UriDescription": "CIS-310 | Google Drive",
        "Uri": "https://drive.google.com/drive/folders/1z-Z5f-f6Nm7Bkx2DsqtgGefEIwQvslzd?usp=sharing",
        "Bullets": [
          "1st, 2nd, and 3rd Normal Form",
          "E-R modeling",
          "SQL"
        ]
      },
      {
        "Title": "Infrastructure Technologies",
        "SubTitle": "Educational",
        "Description": "This course provides an introduction to IT infrastructure issues and covers topics related to computer and systems architecture and communication networks, with an overall focus on the services and capabilities that IT infrastructure solutions enable in an organizational context. It imparted the knowledge and skills I would need for communicating effectively with professionals whose special focus is on hardware and systems software technology and for designing processes and solutions that require in-depth understanding of the IT infrastructure capabilities and limitations. It also prepared me for interaction with external vendors of IT infrastructure components and solutions.",
        "UriDescription": "CIS-350 | Google Drive",
        "Uri": "https://drive.google.com/drive/folders/1YE4rYq2287AiNK6BQHih7e7gGYXmM-dc?usp=sharing",
        "Bullets": [
          "Detailed understanding of systems architecture",
          "Numeric conversion between decimal, hexidecimal, octal, and binary",
          "Familiarity with various hardware components, data formats, and network communication"
        ]
      },
      {
        "Title": "Computer Information Systems",
        "SubTitle": "Educational",
        "Description": "The study of computer information systems as they support business processes. Topics include the role of data, data manipulation, database management, information management and decision making, systems analysis and design, historical vs. current methodology in data communications, hardware and software in telecommunications, an overview of automated information systems, policies and procedures needed to protect an information system, and advanced use of spreadsheet and database software.",
        "UriDescription": "CIS-300 | Google Drive",
        "Uri": "https://drive.google.com/drive/folders/1f_SbezoF6DffBvtbEhBp0sItE4hovVOm?usp=sharing",
        "Bullets": [
          "Competency with MS Excel and MS Access",
          "Complex Excel queries involving data manipulation and analysis"
        ]
      },
      {
        "Title": "Fundamentals of Information Systems",
        "SubTitle": "Educational",
        "Description": "This course provides an overview of contemporary information systems, and how they are used in organizations. It presents an introduction to the discipline of CIS and how information systems can be used to create competitive advantage. Topics include application/web development, including the system development life cycle, information security, business process management, and emerging technologies. I developed a basic web sites including the use of HTML, CSS, and Javascript.",
        "UriDescription": "CIS-150 | Google Drive",
        "Uri": "https://drive.google.com/drive/folders/1-3JZmvlYkQXI8jhluolHUNDQmi2Ze5jh?usp=sharing",
        "Bullets": [
          "Understanding software development life cycle (SDLC)",
          "Various projects demonstrating basic website construction with HTML, CSS, and Javascript"
        ]
      },
      {
        "Title": "Software Development I",
        "SubTitle": "Educational",
        "Description": "This course introduces object-oriented concepts such as the use of classes, methods, encapsulation, and inheritance. The course concentrates on using object-oriented programming to solve simple problems involving input and output.",
        "UriDescription": "CIS-199 | GitHub Repos",
        "Uri": "https://github.com/search?q=user%3Anickmartin1ee7+CIS-199&type=repositories",
        "Bullets": [
          "Introduction to C# and Object-Oriented programming",
          "Various projects demonstrating classes, methods, encapsulation, and inheritance"
        ]
      }
    ]
  }
}